name: "CUHK01"
#richness: 1000

##################################### data #####################################
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 50 dim: 3 dim: 224 dim: 112 } }
}

#################end of input##############################################
#################begin of convolution######################################
layer {
  name: "conv1/3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BN"
  bottom: "conv1/3x3_s2"
  top: "conv1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv1_bn"
  top: "conv1_relu"
  name: "conv1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv2/3x3_s1"
  type: "Convolution"
  bottom: "conv1_relu"
  top: "conv2/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}
layer {
  name: "conv2_bn"
  type: "BN"
  bottom: "conv2/3x3_s1"
  top: "conv2_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv2_bn"
  top: "conv2_relu"
  name: "conv2_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv3/3x3_s1"
  type: "Convolution"
  bottom: "conv2_relu"
  top: "conv3/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
  name: "conv3_bn"
  type: "BN"
  bottom: "conv3/3x3_s1"
  top: "conv3_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv3_bn"
  top: "conv3_relu"
  name: "conv3_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "conv3_relu"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}

layer {
  name: "conv4/3x3_s1"
  type: "Convolution"
  bottom: "pool1/3x3_s2"
  top: "conv4/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}
layer {
  name: "conv4_bn"
  type: "BN"
  bottom: "conv4/3x3_s1"
  top: "conv4_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv4_bn"
  top: "conv4_relu"
  name: "conv4_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv5/3x3_s2"
  type: "Convolution"
  bottom: "conv4_relu"
  top: "conv5/3x3_s2"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 2
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}
layer {
  name: "conv5_bn"
  type: "BN"
  bottom: "conv5/3x3_s2"
  top: "conv5_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv5_bn"
  top: "conv5_relu"
  name: "conv5_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv6/3x3_s1"
  type: "Convolution"
  bottom: "conv5_relu"
  top: "conv6/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 2
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}
layer {
  name: "conv6_bn"
  type: "BN"
  bottom: "conv6/3x3_s1"
  top: "conv6_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "conv6_bn"
  top: "conv6_relu"
  name: "conv6_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
#################end of convolution########################################
#################begin of inception########################################
#--------------------------------#
##Start of inception_v3 block 1##
#--------------------------------#

layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "conv6_relu"
  top: "inception_3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/1x1_bn"
  type: "BN"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/1x1_bn"
  top: "inception_3a/1x1_relu"
  name: "inception_3a/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "conv6_relu"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/3x3_reduce_bn"
  top: "inception_3a/3x3_reduce_relu"
  name: "inception_3a/3x3_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_relu"
  top: "inception_3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/3x3_bn"
  type: "BN"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/3x3_bn"
  top: "inception_3a/3x3_relu"
  name: "inception_3a/3x3_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3a/3x3x2_reduce"
  type: "Convolution"
  bottom: "conv6_relu"
  top: "inception_3a/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/3x3x2_reduce_bn"
  type: "BN"
  bottom: "inception_3a/3x3x2_reduce"
  top: "inception_3a/3x3x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/3x3x2_reduce_bn"
  top: "inception_3a/3x3x2_reduce_relu"
  name: "inception_3a/3x3x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/3x3x2_1"
  type: "Convolution"
  bottom: "inception_3a/3x3x2_reduce_relu"
  top: "inception_3a/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/3x3x2_1_bn"
  type: "BN"
  bottom: "inception_3a/3x3x2_1"
  top: "inception_3a/3x3x2_1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/3x3x2_1_bn"
  top: "inception_3a/3x3x2_1_relu"
  name: "inception_3a/3x3x2_1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3a/3x3x2_2"
  type: "Convolution"
  bottom: "inception_3a/3x3x2_1_relu"
  top: "inception_3a/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/3x3x2_2_bn"
  type: "BN"
  bottom: "inception_3a/3x3x2_2"
  top: "inception_3a/3x3x2_2_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/3x3x2_2_bn"
  top: "inception_3a/3x3x2_2_relu"
  name: "inception_3a/3x3x2_2_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "conv6_relu"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/pool_proj_bn"
  type: "BN"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3a/pool_proj_bn"
  top: "inception_3a/pool_proj_relu"
  name: "inception_3a/pool_proj_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1_relu"
  bottom: "inception_3a/3x3_relu"
  bottom: "inception_3a/3x3x2_2_relu"
  bottom: "inception_3a/pool_proj_relu"
  top: "inception_3a/output"
}

# End of first inception_v3 block a #
#-----------------------------------#


# Start of inception_v3 block b #

layer {
  name: "inception_3b/1x1"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/1x1_bn"
  type: "BN"
  bottom: "inception_3b/1x1"
  top: "inception_3b/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/1x1_bn"
  top: "inception_3b/1x1_relu"
  name: "inception_3b/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/3x3_reduce_bn"
  top: "inception_3b/3x3_reduce_relu"
  name: "inception_3b/3x3_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce_relu"
  top: "inception_3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/3x3_bn"
  type: "BN"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/3x3_bn"
  top: "inception_3b/3x3_relu"
  name: "inception_3b/3x3_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3x2_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/3x3x2_reduce_bn"
  type: "BN"
  bottom: "inception_3b/3x3x2_reduce"
  top: "inception_3b/3x3x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/3x3x2_reduce_bn"
  top: "inception_3b/3x3x2_reduce_relu"
  name: "inception_3b/3x3x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3x2_1"
  type: "Convolution"
  bottom: "inception_3b/3x3x2_reduce_relu"
  top: "inception_3b/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/3x3x2_1_bn"
  type: "BN"
  bottom: "inception_3b/3x3x2_1"
  top: "inception_3b/3x3x2_1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/3x3x2_1_bn"
  top: "inception_3b/3x3x2_1_relu"
  name: "inception_3b/3x3x2_1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3b/3x3x2_2"
  type: "Convolution"
  bottom: "inception_3b/3x3x2_1_relu"
  top: "inception_3b/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/3x3x2_2_bn"
  type: "BN"
  bottom: "inception_3b/3x3x2_2"
  top: "inception_3b/3x3x2_2_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/3x3x2_2_bn"
  top: "inception_3b/3x3x2_2_relu"
  name: "inception_3b/3x3x2_2_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/pool_proj_bn"
  type: "BN"
  bottom: "inception_3b/pool_proj"
  top: "inception_3b/pool_proj_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3b/pool_proj_bn"
  top: "inception_3b/pool_proj_relu"
  name: "inception_3b/pool_proj_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "inception_3b/1x1_relu"
  bottom: "inception_3b/3x3_relu"
  bottom: "inception_3b/3x3x2_2_relu"
  bottom: "inception_3b/pool_proj_relu"
  top: "inception_3b/output"
}

# End of inception_v3 block b #
#----------------------------#

# Start of inception_v3 block c#

layer {
  name: "inception_3c/1x1"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/1x1_bn"
  type: "BN"
  bottom: "inception_3c/1x1"
  top: "inception_3c/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/1x1_bn"
  top: "inception_3c/1x1_relu"
  name: "inception_3c/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3c/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3c/3x3_reduce"
  top: "inception_3c/3x3_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/3x3_reduce_bn"
  top: "inception_3c/3x3_reduce_relu"
  name: "inception_3c/3x3_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3"
  type: "Convolution"
  bottom: "inception_3c/3x3_reduce_relu"
  top: "inception_3c/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/3x3_bn"
  type: "BN"
  bottom: "inception_3c/3x3"
  top: "inception_3c/3x3_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/3x3_bn"
  top: "inception_3c/3x3_relu"
  name: "inception_3c/3x3_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3x2_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/3x3x2_reduce_bn"
  type: "BN"
  bottom: "inception_3c/3x3x2_reduce"
  top: "inception_3c/3x3x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/3x3x2_reduce_bn"
  top: "inception_3c/3x3x2_reduce_relu"
  name: "inception_3c/3x3x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3x2_1"
  type: "Convolution"
  bottom: "inception_3c/3x3x2_reduce_relu"
  top: "inception_3c/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/3x3x2_1_bn"
  type: "BN"
  bottom: "inception_3c/3x3x2_1"
  top: "inception_3c/3x3x2_1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/3x3x2_1_bn"
  top: "inception_3c/3x3x2_1_relu"
  name: "inception_3c/3x3x2_1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3c/3x3x2_2"
  type: "Convolution"
  bottom: "inception_3c/3x3x2_1_relu"
  top: "inception_3c/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/3x3x2_2_bn"
  type: "BN"
  bottom: "inception_3c/3x3x2_2"
  top: "inception_3c/3x3x2_2_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/3x3x2_2_bn"
  top: "inception_3c/3x3x2_2_relu"
  name: "inception_3c/3x3x2_2_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3c/pool"
  type: "Pooling"
  bottom: "inception_3b/output"
  top: "inception_3c/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3c/pool_proj"
  type: "Convolution"
  bottom: "inception_3c/pool"
  top: "inception_3c/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3c/pool_proj_bn"
  type: "BN"
  bottom: "inception_3c/pool_proj"
  top: "inception_3c/pool_proj_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_3c/pool_proj_bn"
  top: "inception_3c/pool_proj_relu"
  name: "inception_3c/pool_proj_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/output"
  type: "Concat"
  bottom: "inception_3c/1x1_relu"
  bottom: "inception_3c/3x3_relu"
  bottom: "inception_3c/3x3x2_2_relu"
  bottom: "inception_3c/pool_proj_relu"
  top: "inception_3c/output"
}

# End of inception_v3 block b #
#----------------------------#



layer {
  name: "inception_3_end/output"
  type: "Pooling"
  bottom: "inception_3c/output"
  top: "inception_3_end/output"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}

# Start of Inception_v3 modelb #
#------------------------------#

layer {
  name: "inception_4a/1x1"
  type: "Convolution"
  bottom: "inception_3_end/output"
  top: "inception_4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x1_bn"
  type: "BN"
  bottom: "inception_4a/1x1"
  top: "inception_4a/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x1_bn"
  top: "inception_4a/1x1_relu"
  name: "inception_4a/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}



layer {
  name: "inception_4a/1x7x2_reduce"
  type: "Convolution"
  bottom: "inception_3_end/output"
  top: "inception_4a/1x7x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x7x2_reduce_bn"
  type: "BN"
  bottom: "inception_4a/1x7x2_reduce"
  top: "inception_4a/1x7x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x7x2_reduce_bn"
  top: "inception_4a/1x7x2_reduce_relu"
  name: "inception_4a/1x7x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4a/1x7"
  type: "Convolution"
  bottom: "inception_4a/1x7x2_reduce_relu"
  top: "inception_4a/1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x7_bn"
  type: "BN"
  bottom: "inception_4a/1x7"
  top: "inception_4a/1x7_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x7_bn"
  top: "inception_4a/1x7_relu"
  name: "inception_4a/1x7_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/7x1"
  type: "Convolution"
  bottom: "inception_4a/1x7_relu"
  top: "inception_4a/7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/7x1_bn"
  type: "BN"
  bottom: "inception_4a/7x1"
  top: "inception_4a/7x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/7x1_bn"
  top: "inception_4a/7x1_relu"
  name: "inception_4a/7x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/1x7x4_reduce"
  type: "Convolution"
  bottom: "inception_3_end/output"
  top: "inception_4a/1x7x4_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x7x4_reduce_bn"
  type: "BN"
  bottom: "inception_4a/1x7x4_reduce"
  top: "inception_4a/1x7x4_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x7x4_reduce_bn"
  top: "inception_4a/1x7x4_reduce_relu"
  name: "inception_4a/1x7x4_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4a/1x7xa"
  type: "Convolution"
  bottom: "inception_4a/1x7x4_reduce_relu"
  top: "inception_4a/1x7xa"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x7xa_bn"
  type: "BN"
  bottom: "inception_4a/1x7xa"
  top: "inception_4a/1x7xa_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x7xa_bn"
  top: "inception_4a/1x7xa_relu"
  name: "inception_4a/1x7xa_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/7x1xa"
  type: "Convolution"
  bottom: "inception_4a/1x7xa_relu"
  top: "inception_4a/7x1xa"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/7x1xa_bn"
  type: "BN"
  bottom: "inception_4a/7x1xa"
  top: "inception_4a/7x1xa_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/7x1xa_bn"
  top: "inception_4a/7x1xa_relu"
  name: "inception_4a/7x1xa_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/1x7xb"
  type: "Convolution"
  bottom: "inception_4a/7x1xa_relu"
  top: "inception_4a/1x7xb"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/1x7xb_bn"
  type: "BN"
  bottom: "inception_4a/1x7xb"
  top: "inception_4a/1x7xb_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/1x7xb_bn"
  top: "inception_4a/1x7xb_relu"
  name: "inception_4a/1x7xb_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/7x1xb"
  type: "Convolution"
  bottom: "inception_4a/1x7xb_relu"
  top: "inception_4a/7x1xb"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/7x1xb_bn"
  type: "BN"
  bottom: "inception_4a/7x1xb"
  top: "inception_4a/7x1xb_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/7x1xb_bn"
  top: "inception_4a/7x1xb_relu"
  name: "inception_4a/7x1xb_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4a/pool"
  type: "Pooling"
  bottom: "inception_3_end/output"
  top: "inception_4a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj"
  type: "Convolution"
  bottom: "inception_4a/pool"
  top: "inception_4a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/pool_proj_bn"
  type: "BN"
  bottom: "inception_4a/pool_proj"
  top: "inception_4a/pool_proj_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4a/pool_proj_bn"
  top: "inception_4a/pool_proj_relu"
  name: "inception_4a/pool_proj_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4a/output"
  type: "Concat"
  bottom: "inception_4a/1x1_relu"
  bottom: "inception_4a/7x1_relu"
  bottom: "inception_4a/7x1xb_relu"
  bottom: "inception_4a/pool_proj_relu"
  top: "inception_4a/output"
}


# module 4b

layer {
  name: "inception_4b/1x1"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x1_bn"
  type: "BN"
  bottom: "inception_4b/1x1"
  top: "inception_4b/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x1_bn"
  top: "inception_4b/1x1_relu"
  name: "inception_4b/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}



layer {
  name: "inception_4b/1x7x2_reduce"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/1x7x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x7x2_reduce_bn"
  type: "BN"
  bottom: "inception_4b/1x7x2_reduce"
  top: "inception_4b/1x7x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x7x2_reduce_bn"
  top: "inception_4b/1x7x2_reduce_relu"
  name: "inception_4b/1x7x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4b/1x7"
  type: "Convolution"
  bottom: "inception_4b/1x7x2_reduce_relu"
  top: "inception_4b/1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x7_bn"
  type: "BN"
  bottom: "inception_4b/1x7"
  top: "inception_4b/1x7_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x7_bn"
  top: "inception_4b/1x7_relu"
  name: "inception_4b/1x7_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4b/7x1"
  type: "Convolution"
  bottom: "inception_4b/1x7_relu"
  top: "inception_4b/7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/7x1_bn"
  type: "BN"
  bottom: "inception_4b/7x1"
  top: "inception_4b/7x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/7x1_bn"
  top: "inception_4b/7x1_relu"
  name: "inception_4b/7x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}




layer {
  name: "inception_4b/1x7x4_reduce"
  type: "Convolution"
  bottom: "inception_4a/output"
  top: "inception_4b/1x7x4_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x7x4_reduce_bn"
  type: "BN"
  bottom: "inception_4b/1x7x4_reduce"
  top: "inception_4b/1x7x4_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x7x4_reduce_bn"
  top: "inception_4b/1x7x4_reduce_relu"
  name: "inception_4b/1x7x4_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4b/1x7xa"
  type: "Convolution"
  bottom: "inception_4b/1x7x4_reduce_relu"
  top: "inception_4b/1x7xa"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x7xa_bn"
  type: "BN"
  bottom: "inception_4b/1x7xa"
  top: "inception_4b/1x7xa_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x7xa_bn"
  top: "inception_4b/1x7xa_relu"
  name: "inception_4b/1x7xa_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4b/7x1xa"
  type: "Convolution"
  bottom: "inception_4b/1x7xa_relu"
  top: "inception_4b/7x1xa"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/7x1xa_bn"
  type: "BN"
  bottom: "inception_4b/7x1xa"
  top: "inception_4b/7x1xa_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/7x1xa_bn"
  top: "inception_4b/7x1xa_relu"
  name: "inception_4b/7x1xa_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4b/1x7xb"
  type: "Convolution"
  bottom: "inception_4b/7x1xa_relu"
  top: "inception_4b/1x7xb"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/1x7xb_bn"
  type: "BN"
  bottom: "inception_4b/1x7xb"
  top: "inception_4b/1x7xb_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/1x7xb_bn"
  top: "inception_4b/1x7xb_relu"
  name: "inception_4b/1x7xb_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_4b/7x1xb"
  type: "Convolution"
  bottom: "inception_4b/1x7xb_relu"
  top: "inception_4b/7x1xb"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad_h: 3
    kernel_h: 7
    kernel_w: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/7x1xb_bn"
  type: "BN"
  bottom: "inception_4b/7x1xb"
  top: "inception_4b/7x1xb_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/7x1xb_bn"
  top: "inception_4b/7x1xb_relu"
  name: "inception_4b/7x1xb_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}



layer {
  name: "inception_4b/pool"
  type: "Pooling"
  bottom: "inception_4a/output"
  top: "inception_4b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj"
  type: "Convolution"
  bottom: "inception_4b/pool"
  top: "inception_4b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/pool_proj_bn"
  type: "BN"
  bottom: "inception_4b/pool_proj"
  top: "inception_4b/pool_proj_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4b/pool_proj_bn"
  top: "inception_4b/pool_proj_relu"
  name: "inception_4b/pool_proj_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4b/output"
  type: "Concat"
  bottom: "inception_4b/1x1_relu"
  bottom: "inception_4b/7x1_relu"
  bottom: "inception_4b/7x1xb_relu"
  bottom: "inception_4b/pool_proj_relu"
  top: "inception_4b/output"
}




# module 4c


layer {
  name: "inception_4c/1x1"
  type: "Convolution"
  bottom: "inception_4b/output"
  top: "inception_4c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/1x1_bn"
  type: "BN"
  bottom: "inception_4c/1x1"
  top: "inception_4c/1x1_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4c/1x1_bn"
  top: "inception_4c/1x1_relu"
  name: "inception_4c/1x1_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}



layer {
  name: "inception_4c/1x7x2_reduce"
  type: "Convolution"
  bottom: "inception_4b/output"
  top: "inception_4c/1x7x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/1x7x2_reduce_bn"
  type: "BN"
  bottom: "inception_4c/1x7x2_reduce"
  top: "inception_4c/1x7x2_reduce_bn"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1.0000001 }
    bias_filler { type: "constant" value: 0 }
  } 
}
layer {
  bottom: "inception_4c/1x7x2_reduce_bn"
  top: "inception_4c/1x7x2_reduce_relu"
  name: "inception_4c/1x7x2_reduce_relu"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_4c/1x7"
  type: "Convolution"
  bottom: "inception_4c/1x7x2_reduce_relu"
  top: "inception_4c/1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/1x7_bn"
  type: "BN"
